{
  "personal_info": {
    "name": "Amira Shinnawi",
    "title": "Flutter Developer | Mobile App Developer",
    "profile_image": "assets/profile/profile.jpeg",
    "location": "Kafr El Sheikh, Egypt",
    "contact": {
      "phone": "+20 1025167595",
      "email": "amirashenawy123@gmail.com"
    },
    "social_links": [
      {
        "platform": "GitHub",
        "url": "https://github.com/Amira-Shinnawi"
      },
      {
        "platform": "LinkedIn",
        "url": "https://www.linkedin.com/in/amira-shinnawi/"
      }
    ],
    "cv_download": "assets/downloads/Amira_Shinnawi_CV.pdf",
    "about_me": "Mobile App Developer with 1 year of experience in cross-platform development, specializing in Flutter. Skilled in building high-performance, user-focused apps with clean architecture. Also work as a freelance Flutter Instructor, delivering tailored training and mentorship. Passionate about continuous learning, innovation, and contributing to impactful projects within dynamic teams."
  },

  "projects_num": "6",
  "experience_num": "1",
  "customers_num": "0",

  "skills": {
    "soft_skills": [
      "Collaborative",
      "Multitasking",
      "Teamwork",
      "Organized",
      "Strong Communicator",
      "Efficient Time-Manager",
      "Analytical",
      "Adaptable",
      "Proactive",
      "Detail-Oriented",
      "Goal-Oriented",
      "Self-Learner",
      "Critical Thinker"
    ],
    "technical_skills": [
      "Languages: Dart, Java, C#, HTML, CSS",
      "Concepts: OOP, Clean Code, SOLID Principal, Design Patterns",
      "Frameworks and Libraries: Flutter",
      "Databases: Firebase, Xampp, Hive and SQLite",
      "APIs: RESTful APIs, GraphQL",
      "Tools: GitHub, Git, Firebase, Postman, Figma",
      "Architectural Patterns:: Clean Architecture, Bloc Pattern, MVVM, MVC",
      "Responsive UI and Custom Widgets",
      "Testing and Debugging"
    ]
  },
  "education": [
    {
      "degree": "Bachelor of Computers and Information Sciences",
      "institution": " Kafr El-Shaykh University",
      "date_range": "2020 - 2024"
    }
  ],
  "experience": [
    {
      "title": "Flutter Developer",
      "company": " GTS(Global Technology Solutions)",
      "location": "Mansoura, Egypt",
      "date_range": "Nov 2024 - Present",
      "description_points": [
        "Contributed to the development of 4+ cross-platform mobile applications using the Flutter framework.",
        "Collaborated with designers to translate wireframes and mockups into functional features, and worked with backend teams for API integration.",
        "Prepared applications for testing and deployment on Google Play and Apple App Store.",
        "Participated in code reviews, debugging, and performance optimization, ensuring maintainable and efficient code.",
        "Optimized performance and stayed updated with the latest Flutter best practices."
      ]
    },
    {
      "title": "Flutter Instructor (Freelance)",
      "company": "Self-Employed",
      "location": "Remote",
      "date_range": "June 2024 - Present",
      "description_points": [
        "Conduct private, online training sessions in Flutter and Dart for individuals and small groups.",
        "Simplify complex concepts and provide tailored learning approaches to match student levels.",
        "Mentor learners in building functional, responsive mobile applications and applying best practices."
      ]
    },
    {
      "title": "Flutter Instructor",
      "company": "Mindset Trainings",
      "location": "KafrEl Sheikh, Egypt",
      "date_range": "Sep 2024 – Nov2024",
      "description_points": [
        "Developed and delivered comprehensive Flutter courses from beginner to advanced levels, guiding students through building mobile applications.",
        "Created Structured Lesson Plans: Covered key topics including Flutter basics, UI/UX design, state management, and advanced topics like API integration and Firebase.",
        "Provided Hands-On Guidance: Ensured practical understanding through real-world projects, quizzes, and personalized feedback.",
        "Mentored on Best Practices: Taught Flutter development best practices, including resource management, state management, and performance optimization"
      ]
    },
    {
      "title": "Software Engineer Developer",
      "company": " Orange Digital Center",
      "location": "Mansoura, Egypt",
      "date_range": "Aug 2023 – Sep 2023",
      "description_points": [
        "Solidified software engineering fundamentals through dedicated courses in OOP, design patterns, and unit testing.",
        "Successfully applied acquired knowledge to a real project, enhancing code quality and maintainability.",
        "Implemented various design patterns to optimize code structure and reusability.",
        "Established a robust unit testing framework, ensuring code reliability and facilitating bug detection.",
        "Contributed to project success through effective problem-solving and teamwork."
      ]
    },
    {
      "title": "Flutter Developer Trainee",
      "company": "Google Developer Student Club",
      "location": "Remote",
      "date_range": "Dec 2022",
      "description_points": [
        "Developed and maintained Flutter applications using Dart programming language.",
        "Implemented MVVM and MVC architecture for robust and scalable app structure.",
        "Integrated RESTful APIs and GraphQL to connect frontend with backend services seamlessly.",
        "Utilized Shared Preferences and Hive for efficient local data storage and management.",
        "Completed a Flutter project from inception to deployment."
      ]
    }
  ],
  "projects": [
    {
      "name": "Dalil",
      "cover_image": "assets/covers/dalil_mockup.png",
      "short_description": "A comprehensive guide app offering technical services, real-time chat support, and secure in-app payments.",
      "description": "Developed a comprehensive guide app offering various technical services, including identity/profile design, and website and application creation. The app features robust real-time communication by integrating Agora for chat and calls, and ensures secure transactions via Moyaser for in-app payments. The application was built using Flutter, Dart, and the Bloc/Cubit architecture, following the MVVM pattern for a scalable, smooth, and maintainable codebase. Project developed between Nov 2024 and Jan 2024.",
      "features": [
        "Comprehensive catalog of technical services (design, web/app creation)",
        "Real-time chat and calls via Agora for technical support",
        "Secure in-app payment processing using Moyasar integration",
        "MVVM architecture for enhanced scalability and maintainability",
        "Localization support for multi-language usage"
      ],
      "technologies_used": [
        "Flutter",
        "Dart",
        "Cubit/Bloc (State Management)",
        "MVVM (Architecture)",
        "Agora (Chat/Calls SDKs)",
        "Moyasar (Payment Gateway)",
        "Firebase Cloud Messaging",
        "REST API / Dio",
        "Localization",
        "Audio & Media Handlers (e.g., Audio Players, Flutter Sound)",
        "UI/Utility Libraries (e.g., Shimmer, Lottie, ScreenUtil)"
      ],
      "links": [],
      "media": []
    },
    {
      "name": "GTS System",
      "cover_image": "assets/covers/erp_cover.png",
      "short_description": "An ERP application for sales representatives integrated with accounting and business workflows, featuring thermal printing capabilities.",
      "description": "An Enterprise Resource Planning (ERP) system developed for sales representatives to manage core accounting and business workflows. Key functionalities included end-to-end invoice creation, receipt generation, and direct printing via thermal printers. The system also managed stock transfer requests, customer data, and facilitated comprehensive report generation and sharing, all supported by real-time notifications for seamless workflow integration. Built with **Flutter**, **Dart**, and the **Bloc/Cubit** architecture for high scalability and efficient performance. Project developed between Jan 2025 and Mar 2025.",
      "features": [
        "Full ERP support for sales and accounting workflows",
        "Invoice and receipt voucher creation with thermal printer support (ESC/POS)",
        "Real-time stock transfer request management",
        "Customer relationship management (CRM) capabilities",
        "Comprehensive report generation and sharing functionality",
        "Real-time notification system (Firebase Cloud Messaging)"
      ],
      "technologies_used": [
        "Flutter",
        "Dart",
        "Cubit/Bloc (State Management)",
        "MVC (Architecture)",
        "Firebase (Core, Cloud Firestore, Messaging)",
        "REST API / Dio",
        "Thermal Printing",
        "PDF Generation (pdf, qr_flutter)",
        "Animation",
        "UI/Utility Libraries"
      ],
      "links": [],
      "media": []
    },
    {
      "name": "GTS Restaurant System (POS & ERP)",
      "cover_image": "assets/covers/restaurant_cover.png",
      "short_description": "A comprehensive restaurant Point-of-Sale (POS) system integrated with ERP workflows, managing dine-in, takeaway, and delivery orders with thermal printing.",
      "description": "Developed a restaurant Point-of-Sale (POS) system deeply integrated with an existing ERP to efficiently manage all order types: dine-in, takeaway, and delivery. Core features include real-time invoice creation, detailed bill calculations, and direct printing via thermal printers. The system supports complex restaurant operations like transferring invoices, switching tables/rooms, and seamless order handover to delivery staff. Built using **Flutter**, **Dart**, and the **Bloc/Cubit** architecture alongside the **MVVM** pattern, ensuring high performance, stability, and smooth integration with the backend ERP services. Project developed between Mar 2025 and Jul 2025.",
      "features": [
        "Integrated POS for Dine-in, Takeaway, and Delivery order management.",
        "Automated invoice creation, bill calculation, and thermal printing support (via Bluetooth).",
        "Advanced table management: invoice transfer and table/room switching.",
        "Delivery assignment and collection tracking with seamless staff handover.",
        "Efficient performance and smooth integration with external ERP systems."
      ],
      "technologies_used": [
        "Flutter",
        "Dart",
        "Cubit/Bloc (State Management)",
        "MVVM (Architecture)",
        "REST API / Dio",
        "Firebase (Core, Cloud Firestore)",
        "Thermal Printing (Flutter Thermal Printer)",
        "Bluetooth Communication (Flutter Blue Plus)",
        "UI/Utility Libraries (e.g., Shimmer, data_table_2, Animation)"
      ],
      "links": [],
      "media": []
    },
    {
      "name": "GTS E-Commerce (ERP Integrated)",
      "cover_image": "assets/covers/ecommerce_cover.png",
      "short_description": "An ERP-integrated e-commerce platform for product browsing, secure order placement, purchase management, and online payment processing.",
      "description": "Developed a full-featured e-commerce application integrated with an Enterprise Resource Planning (ERP) system to manage the entire sales lifecycle. Features include detailed product browsing, secure order placement, purchase history management, and integrated notifications. Crucially, the system incorporated a secure payment gateway for seamless online transactions and utilized **SignalR** for real-time updates and notification synchronization. Built with **Flutter**, **Dart**, and the **Bloc/Cubit** architecture following the **MVVM** pattern, ensuring high stability and efficient ERP integration. Project developed between Jul 2025 and Sep 2025.",
      "features": [
        "Full-featured product catalog and browsing experience.",
        "Secure shopping cart and order placement integrated with ERP.",
        "Integrated secure payment gateway for online transactions (Pay Integration).",
        "Real-time order status and notification system (SignalR/Firebase Messaging).",
        "Comprehensive purchase history and management features."
      ],
      "technologies_used": [
        "Flutter",
        "Dart",
        "Cubit/Bloc (State Management)",
        "MVVM (Architecture)",
        "REST API / Dio",
        "SignalR (Real-time Communication)",
        "Payment Gateway Integration (Flutter Credit Card UI)",
        "Firebase Cloud Messaging & Local Notifications",
        "UI/Utility Libraries (e.g., Lottie, Shimmer, Animation, Staggered Grid View)"
      ],
      "links": [],
      "media": []
    },
    {
      "name": "GTS Delivery",
      "cover_image": "assets/covers/delivery_cover.png",
      "short_description": "A real-time delivery management application integrated with the E-commerce system for order assignment, tracking, and payment collection.",
      "description": "Developed a dedicated mobile application for delivery personnel, seamlessly connected to the e-commerce system to handle real-time logistics and order assignments. The app utilized **SignalR** for instant order updates and notifications, allowing delivery staff to accept or reject orders in real-time. Key features included secure payment collection, comprehensive order tracking, and advanced localization support, ensuring smooth, coordinated workflow between the e-commerce platform, customers, and the delivery team. Built using **Flutter**, **Dart**, and the **Bloc/Cubit** architecture following the **MVVM** pattern. Project developed between Sep 2025 and Oct 2025.",
      "features": [
        "Real-time order assignment and status management.",
        "SignalR integration for instant notifications (accept/reject functionality).",
        "Features for tracking and handling payment collections.",
        "Smooth coordination and communication between systems.",
        "Multi-language support (Localization)."
      ],
      "technologies_used": [
        "Flutter",
        "Dart",
        "Cubit/Bloc (State Management)",
        "MVVM (Architecture)",
        "REST API / Dio",
        "SignalR (Real-time Communication)",
        "Localization",
        "Animation (Lottie, Carousel Slider)",
        "Utility Libraries (e.g., Flutter Secure Storage, Timeago, Connectivity Monitor)"
      ],
      "links": [],
      "media": []
    },
    {
      "name": "Ghosn App (AI Plant Assistant & Store)",
      "cover_image": "assets/covers/Ghosn.png",
      "short_description": "A personal plant care assistant and e-commerce platform featuring AI-powered disease diagnosis via image recognition.",
      "description": "Ghosn acts as a comprehensive personal guide for plant enthusiasts, covering selection, care, and commerce. The application offers a wide variety of plants through an integrated online store and provides expert, tailored care documentation for each user's plants. Its most advanced feature is the **AI Assistant**, which uses machine learning and image recognition to accurately identify plant diseases. The platform also includes a community hub and a reliable **Reminders/Notification** system for watering and pruning routines. The application is built using **Flutter**, Dart, and incorporates **Firebase**, **GraphQL/RESTful APIs**, and the robust **Cubit/Bloc** architecture following the **MVVM** pattern.",
      "features": [
        "Personalized Plant Assistant for selection and care.",
        "Online Plant Store offering a wide variety of flora.",
        "AI Assistant for plant disease diagnosis (Image Recognition/Machine Learning).",
        "Community platform for plant enthusiasts.",
        "Automated reminders and notifications for plant care (Watering/Pruning).",
        "Full-stack integration using Firebase, GraphQL, and RESTful APIs."
      ],
      "technologies_used": [
        "Flutter",
        "Dart",
        "Cubit/Bloc (State Management)",
        "MVVM (Architecture)",
        "GraphQL / RESTful API (Dio)",
        "Firebase (Core, Messaging)",
        "AI/ML Integration (for Diagnosis)",
        "GoRouter (Navigation)",
        "GetIt (Dependency Injection)",
        "Animation (Lottie, Rive)",
        "Camera / Image Picker",
        "Local Notifications & WorkManager"
      ],
      "links": [],
      "media": []
    }
  ]
}
